In [1]:
iris

NameError: name 'iris' is not defined

In [2]:
import seaborn.apionly as sns;
iris = sns.load_dataset('iris')

/anaconda3/lib/python3.6/site-packages/seaborn/apionly.py:6: UserWarning: As seaborn no longer sets a default style on import, the seaborn.apionly module is deprecated. It will be removed in a future version.
  warnings.warn(msg, UserWarning)

In [3]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [1]:
import pandas as pd

In [6]:
pd.isnull(iris)

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
5           False        False         False        False    False
6           False        False         False        False    False
7           False        False         False        False    False
8           False        False         False        False    False
9           False        False         False        False    False
10          False        False         False        False    False
11          False        False         False        False    False
12          False        False         False        False    False
13          False        False         False        False    False
14          False        False         False        False    False
15          False        False         False        False    False
16          False        False         False        False    False
17          False        False         False        False    False
18          False        False         False        False    False
19          False        False         False        False    False
20          False        False         False        False    False
21          False        False         False        False    False
22          False        False         False        False    False
23          False        False         False        False    False
24          False        False         False        False    False
25          False        False         False        False    False
26          False        False         False        False    False
27          False        False         False        False    False
28          False        False         False        False    False
29          False        False         False        False    False
..            ...          ...           ...          ...      ...
120         False        False         False        False    False
121         False        False         False        False    False
122         False        False         False        False    False
123         False        False         False        False    False
124         False        False         False        False    False
125         False        False         False        False    False
126         False        False         False        False    False
127         False        False         False        False    False
128         False        False         False        False    False
129         False        False         False        False    False
130         False        False         False        False    False
131         False        False         False        False    False
132         False        False         False        False    False
133         False        False         False        False    False
134         False        False         False        False    False
135         False        False         False        False    False
136         False        False         False        False    False
137         False        False         False        False    False
138         False        False         False        False    False
139         False        False         False        False    False
140         False        False         False        False    False
141         False        False         False        False    False
142         False        False         False        False    False
143         False        False         False        False    False
144         False        False         False        False    False
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [9]:
# ----------------------------- MISSING DATA -----------------------------------------
import numpy as np

In [43]:
x = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [11]:
x

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [12]:
# now lets check for null values

In [14]:
x.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [15]:
x[0] = None

In [16]:
x

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [17]:
x.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [18]:
# we can see that None is also considered to be null

In [19]:
# the opposite is notnull

In [20]:
x.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [21]:
# vectorized drop NA values
x.dropna()

1    artichoke
3      avocado
dtype: object

In [18]:
import numpy as np
NA = np.nan

In [22]:
# ------------------------------ DataFrame and Missing values ---------------------------------------

In [19]:
data = pd.DataFrame([[1,6.5,3],[1., NA, NA],[NA,NA,NA],[NA,6.5,3.] ])

In [28]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [29]:
# drop.na here by defualt is like R's na.omit

In [24]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [31]:
# what if you want to get rid of rows with only NA
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [32]:
# you can add an axis = 1 argument to drop columns of all NA

In [33]:
# you can also add a threshold where you drop columns

In [41]:
# drop rows with 2 or more NA values
data.dropna(thresh=2)

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [46]:
# filling NA values
x.fillna('missing')

0     aardvark
1    artichoke
2      missing
3      avocado
dtype: object

In [47]:
# DataFrame case

In [49]:
data.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [52]:
# suppose you want to do something different for each column
data.fillna({0:100,1:200,2:300})

       0      1      2
0    1.0    6.5    3.0
1    1.0  200.0  300.0
2  100.0  200.0  300.0
3  100.0    6.5    3.0

In [53]:
# you can also modify in place
# using inplace = True
# not doing it here because I want the data to stay intact

In [55]:
# you can also do a function of a variable like the median

In [56]:
#----------------------------- DUPLICATES --------------------------------------------
#-------------------------------------------------------------------------------------

In [58]:
# removing duplicate rows

In [5]:
import pandas as pd;
data = pd.DataFrame({'k1':['one','two','one','two','one','two','two'],'k2':[1,1,2,3,3,4,4]})

In [6]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [7]:
# boolean vector of duplicate or not

In [8]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [11]:
# dropping duplicates
data2 = data.drop_duplicates()

In [12]:
data2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [13]:
# by defualt it keeps the first one that occurs you could do keep = 'last' to change this
# you can also remove duplicates on specific columns
data.drop_duplicates('k1')

    k1  k2
0  one   1
1  two   1

In [14]:
data['v1'] = range(7)

In [15]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [25]:
# question can you remove NA values on only a subset of columns as well???
# not sure ask about it.

In [26]:
# ----------------------------TRANSFORMING DATA -----------------------------------------------

In [50]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
'ounces':[4,3,12,6,7.5,8,3,5,6] })

In [28]:
data.head()

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5

In [29]:
# lets do a mapping again using a dict structure

In [31]:
meat_to_animal = {
'bacon':'pig',
'pulled pork':'pig',
'pastrami':'cow',
'corned beef':'cow',
'honey ham':'pig',
'nova lox':'salmon'
}

In [32]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [33]:
data.food

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [43]:
# you can convert a string to lower case with column.str.lower()
lowercased = data.food.str.lower();

pandas.core.series.Series

In [36]:
data['animal'] = lowercased.map(meat_to_animal)

In [42]:
data.animal

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [44]:
# syntax for applying a function to a series is series.map(function)
# a dict mapping acts as a function but since it is longer it is better to create a seperate object for it

In [45]:
# we created a seperate series. I wanted to know if you can modify the column first then map it

In [46]:
# approach 2

In [47]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [53]:
data['food'] = data.food.str.lower()

In [54]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [55]:
data['animal2'] = data.food.map(meat_to_animal)

In [56]:
data

          food  ounces animal2
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [57]:
# is there any case when equivelent in pandas

In [58]:
# what about normal functions

In [60]:
data['log_ounces'] = np.log(data.ounces)

In [61]:
data['log_ounces']

0    1.386294
1    1.098612
2    2.484907
3    1.791759
4    2.014903
5    2.079442
6    1.098612
7    1.609438
8    1.791759
Name: log_ounces, dtype: float64

In [62]:
# thus we see that map is not needed when you can use a function that can operate on a series

In [63]:
# ------------------------------------- REPLACING VALUES -----------------------------------------------------

In [64]:
# there is a simpler function for replacing values

In [65]:
data = pd.Series([1., -999., 2., -999., -1000, 3.])

In [66]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [67]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [68]:
# now to replace multiple values with one value
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [69]:
# it can also be element wise replacing
data.replace( [-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [70]:
# can also use a dict
data.replace( {-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [71]:
# for strings you should use a seperate function covered later

In [72]:
# ------------------------------- RENAMING AXIS LABELS -----------------------------------------------

In [73]:
data = pd.DataFrame( np.arange(12).reshape( (3,4)),index =['Ohio','Colorado', 'New York'], 
                    columns = ['one','two','three','four'])

In [74]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [75]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [76]:
data.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [77]:
transform = lambda x: x[:4].upper()

In [78]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [82]:
data.index.str.lower()

Index(['ohio', 'colorado', 'new york'], dtype='object')

In [83]:
data.index = data.index.str.lower()

In [84]:
data.index

Index(['ohio', 'colorado', 'new york'], dtype='object')

In [85]:
data.head()

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [86]:
data.index = data.index.str.upper()

In [87]:
data.index

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [88]:
data.index = ['ohio', 'colorado','new york']

In [89]:
data.index

Index(['ohio', 'colorado', 'new york'], dtype='object')

In [90]:
data.columns = data.columns.str.upper()

In [91]:
data.columns

Index(['ONE', 'TWO', 'THREE', 'FOUR'], dtype='object')

In [92]:
data.columns = data.columns.str.lower()

In [93]:
data.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [94]:
# using a map method is more complicated but also works

In [95]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [97]:
# creating a new version
# use rename function
data.rename(index = str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [98]:
# some important notes is that title refers to capatilizing the first letter of each word
# str here means the existing string for index and column respectively

In [99]:
# you can also use dict inputs
data.rename( index = {'OHIO':'INDIANA'},columns = {'three':'peekaboo'})

          one  two  peekaboo  four
ohio        0    1         2     3
colorado    4    5         6     7
new york    8    9        10    11

In [100]:
# also takes an inplace argument

In [101]:
# --------------------------------------------- BINNING -------------------------------------------------------

In [102]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [103]:
# the name of the function to bin them is exactly the same as in R
cats = pd.cut(ages,[18,25,35,60,100])

In [104]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [105]:
# the output is essentially a category. This is equivelent to factors in R

In [106]:
# codes is the number associated with the category
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [107]:
# you can extract the distinct categories
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [108]:
# the type of object is an index
type(cats.categories)

pandas.core.indexes.interval.IntervalIndex

In [109]:
# value_counts gives you a count for a categorical or numeric variable like table(x) in R
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [110]:
pd.value_counts(ages)

31    1
61    1
27    1
45    1
25    1
23    1
22    1
21    1
20    1
41    1
37    1
32    1
dtype: int64

In [114]:
# if you want left closed than you can use right = False
# you can also assign your own bin labels
pd.cut( ages, [18,26,36,61,100], right = False, labels = ['Youth','YoungAdult','MiddleAged','Senior'])

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [ ]:
# what if you simply want python to compute equally spaced bins for you?

In [115]:
data = np.random.rand(20)

In [117]:
# instead of a series we input how much bins we want to divide it in
# precision is decimal rounding option
x = pd.cut( data, 4, precision = 2)

In [118]:
x.categories

IntervalIndex([(0.019, 0.24], (0.24, 0.47], (0.47, 0.69], (0.69, 0.91]]
              closed='right',
              dtype='interval[float64]')

In [119]:
# What about sample quantiles?

In [120]:
# very similar to ntile in dplyr
data = np.random.randn(1000)

In [121]:
cats = pd.qcut( data, 4)

In [122]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [124]:
# or you can pass your own quantiles in it
pd.qcut( data, [0,0.1,0.5,0.9,1.])

[(-3.108, -1.334], (1.2, 3.239], (-1.334, -0.029], (-1.334, -0.029], (-1.334, -0.029], ..., (-0.029, 1.2], (1.2, 3.239], (-3.108, -1.334], (-0.029, 1.2], (-0.029, 1.2]]
Length: 1000
Categories (4, interval[float64]): [(-3.108, -1.334] < (-1.334, -0.029] < (-0.029, 1.2] < (1.2, 3.239]]

In [125]:
# ---------------------------------------- OUTLIERS ---------------------------------------------------------

In [126]:
data = pd.DataFrame( np.random.randn(1000,4))

In [128]:
# suppose we select one vector
x = data[2]

In [129]:
from pandas import *

In [131]:
x[ abs(x) > 3]

773   -3.816816
Name: 2, dtype: float64

In [136]:
# normally data[] subsets columns but with a logical series it subsets rows
data[ abs(x) > 3]

            0         1         2         3
773 -0.187487 -0.195993 -3.816816 -0.121156

In [137]:
value_counts( abs(x) > 3)

False    999
True       1
Name: 2, dtype: int64

In [140]:
# data > 3 gives you a logical matrix. Any gives you any row that has n true values 
data[ abs(data > 3).any(1)]

            0         1         2         3
48  -1.505600  3.107345 -0.652217 -0.892619
676 -0.522053  3.087903 -0.936487  0.952934
708  0.884614  3.039905 -1.727867  0.460460
753  4.378510  0.903291  0.315270 -1.026419
786  1.121737  1.176858 -0.269308  3.285338

In [142]:
from numpy import *

In [143]:
# sign gives you 1 or -1 depending on the sign of the value
sign( [1,2,-1,-3])

array([ 1,  1, -1, -1])

In [144]:
data[ abs(data) > 3] = sign(data)

In [145]:
# --------------------------------- PERMUTATIONS AND RANDOM SAMPLING ---------------------------------------

In [146]:
df = pd.DataFrame( np.arange(5 * 4).reshape( (5,4)))

In [147]:
# random.permutation simply shuffles numbers from 0 to n-1
sampler = random.permutation(5)

In [148]:
sampler

array([0, 3, 1, 4, 2])

In [149]:
# two options to filter based on the permutation

In [151]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [152]:
# take uses index values to filter but not logical vectors
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11

In [155]:
# loc takes either indices or logical vectors
df.loc[sampler]

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11

In [161]:
index = [True,False,True,False,True]
df.loc[index]

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

In [157]:
df.sample(3)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19

In [162]:
# you can also sample with replacement
df.sample( n = 10, replace = True)

    0   1   2   3
4  16  17  18  19
4  16  17  18  19
4  16  17  18  19
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
4  16  17  18  19
4  16  17  18  19

In [163]:
# ----------------------------------------- DUMMY VARIABLES ------------------------------------------------------

In [165]:
# converting categorical variables to dummy variables.

In [166]:
df = DataFrame( {'key':['b','b','a','c','a','b'], 'data1':range(6)})

In [167]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [169]:
# Here is how to get a data frame of dummies
get_dummies(df.key)

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [170]:
get_dummies(df)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [173]:
# you can customize the prefix
get_dummies( df.key, prefix = 'k')

   k_a  k_b  k_c
0    0    1    0
1    0    1    0
2    1    0    0
3    0    0    1
4    1    0    0
5    0    1    0

In [175]:
dummies = get_dummies( df.key, prefix = 'key')
# df_with_dummies = df.data1.join(dummies)

In [180]:
# notice how double brackets keeps it as a dataframe. This is the opposite of R
type( df[['data1']])

pandas.core.frame.DataFrame

In [181]:
# this join is different than a join in SQL sense. This simply puts two tables with equal rows togethor
df_with_dummies = df[['data1']].join(dummies)

In [182]:
df_with_dummies

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
# example 2

In [184]:
mnames = [ 'movie_id','title','genres']

In [188]:

# movies = read_table('downloads/movies.dat', sep = "::", header = None, names = mnames)
# SKIPPING FOR NOW BECAUSE I DONT KNOW HOW TO UP LOAD DATA SETS

In [ ]:
# -------------------------------------------- STRING MANIPULATION -----------------------------------------------

In [ ]:
# python is popular partly because of its string manipulation capabilities

In [4]:
# seperating a string
val = 'a,b,  guido'

In [5]:
val.split(',')

['a', 'b', '  guido']

In [6]:
# however split text often has spaces
pieces = [ x.strip() for x in val.split(',')]

In [7]:
pieces

['a', 'b', 'guido']

In [23]:
# strip doesn't work on a series only a string object value. That is why we needed a for loop
x = val.split(',')
x[2].strip()

'guido'

In [206]:
# what about using map methods
type(x)

list

In [222]:
x2 = Series(x);
x3 = asarray(x);
x4 = str(x);
x5 = list(x)
# note that some text functions work on strings only. A string is one dimensional.
# Series cannot be turned into a string so easily

In [226]:
# back to using map methods
type( x5[1])

str

In [2]:
# code could be slightly more expressive
def lapply(x,fun): 
    return list(map(fun,x));

In [228]:
x

['a', 'b', '  guido']

In [230]:
lapply(x,lambda x: x.strip())

['a', 'b', 'guido']

In [3]:
from numpy import *;
import numpy as np

In [15]:
# you can assign element wise for a list or series
first, second, third = pieces

In [16]:
first

'a'

In [10]:
type(pieces)

list

In [17]:
# you can add strings togethor
first + '::' + second + '::' + third

'a::b::guido'

In [19]:
# string detection
'ui' in third

True

In [20]:
'guido' in val

True

In [31]:
# detecting substrings
val.index('b')

2

In [32]:
# similar 
val.find('b')

2

In [33]:
# they differ if the string isn't found
val.find('dog')

-1

In [34]:
val.index('dog')

ValueError: substring not found

In [35]:
# you could return the number of occurrences as well
val.count('dog')

0

In [36]:
val.count(',')

2

In [38]:
# replacing all occurences
val.replace(',',' ')

'a b   guido'

In [39]:
# true or false if a string starts with or ends with a string
val.endswith('ido')

True

In [42]:
val.startswith('a')

True

In [44]:
# position of last occurence
val.rfind(',')

3

In [45]:
# ljust and rjust are to pad a string with space

In [46]:
# re and nltk module is very useful

In [47]:
import re

In [48]:
text = "foo   bar\t baz  \tqux"

In [49]:
text

'foo   bar\t baz  \tqux'

In [50]:
# the expression refering to one or more whitespaces is '\s+'
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [53]:
text.find('o')

1

In [63]:
# some text operators
print('hello\tworld')

hello	world

In [55]:
print('hello\nworld')

hello
world

In [56]:
print('hello\rworld')

world

In [57]:
print('hello\\world')

hello\world

In [60]:
print('hello\"world')

hello"world

In [62]:
print('hello \'world\'')

hello 'world'

In [64]:
# back to regex code 
# when doing re.split it really is first just compiled and then split
regex = re.compile('\s+')

In [65]:
regex

re.compile(r'\s+', re.UNICODE)

In [66]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [67]:
# other stuff you can do with the regex object
# find all elements matching the regex
regex.findall(text)

['   ', '\t ', '  \t']

In [68]:
text

'foo   bar\t baz  \tqux'

In [69]:
# some other alternatives include match and search

In [70]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
""";
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}';

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [71]:
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [72]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [73]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [74]:
# need to understand the pattern expression.

In [75]:
# serch gives you the first and other positional information
m = regex.search(text)

In [76]:
m

In [78]:
text[m.start():m.end()]

'dave@google.com'

In [79]:
m.start()

5

In [80]:
m.end()

20

In [81]:
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'